cases/Tests/rigidBody_ALM/extruded_Cylinder/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #include "include/fixedInlet"

    outlet
    {
        type        inletOutlet;
        inletValue  uniform (0 0 0);
        value       $internalField;
    }

    cylinder
    {
        //type        slip;
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    "(top|bottom|back|front)"
    {
        type            slip;
    }

    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
