cases/Tests/rigidBody_ALM/extruded_Cylinder/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../myVars" //Include global variables

actions
(
    {
        name    turbine;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            type searchableBox;
            min (#calc "-$domain_length" #calc "-$water_depth" $zmin);
            max ($domain_length $domain_height $zmax);
        }
    }

    {
        name    turbine;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set turbine;
        }
    }
);

// ************************************************************************* //
